improved documentation!
